# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [153]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load 
city_data_to_load="Resources/city_data.csv"
ride_data_to_load="Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [154]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [155]:
#  1. Get the total rides for each city type

ride_city_df = pyber_data_df.groupby(["type"]).count()["ride_id"]
ride_city_df

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [156]:
# 2. Get the total drivers for each city type

driver_city_df = pyber_data_df.groupby(["city","type"]).mean()["driver_count"]
driver_city_df = driver_city_df.groupby(["type"]).sum()
driver_city_df

type
Rural         78.0
Suburban     490.0
Urban       2405.0
Name: driver_count, dtype: float64

In [157]:
#  3. Get the total amount of fares for each city type

fare_city_df = pyber_data_df.groupby(["type"]).sum()["fare"]
fare_city_df

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [158]:
#  4. Get the average fare per ride for each city type. 

urban_avg_fare=fare_city_df["Urban"]/ride_city_df["Urban"]
suburban_avg_fare=fare_city_df["Suburban"]/ride_city_df["Suburban"]
rural_avg_fare=fare_city_df["Rural"]/ride_city_df["Rural"]
print(urban_avg_fare)
print(suburban_avg_fare)
print(rural_avg_fare)

24.525772307692307
30.970128000000003
34.62344

In [159]:
avg_ride_fare_df=pd.DataFrame((fare_city_df/ride_city_df))

avg_ride_fare_df

                  0
type
Rural     34.623440
Suburban  30.970128
Urban     24.525772

In [160]:
# 5. Get the average fare per driver for each city type. 

urban_driver_fare=fare_city_df["Urban"]/driver_city_df["Urban"]
suburban_driver_fare=fare_city_df["Suburban"]/driver_city_df["Suburban"]
rural_driver_fare=fare_city_df["Rural"]/driver_city_df["Rural"]
print(urban_driver_fare)
print(suburban_driver_fare)
print(rural_driver_fare)

16.571467775467774
39.50271428571429
55.48628205128205

In [161]:
avg_driver_fare_df=pd.DataFrame((fare_city_df/driver_city_df))

avg_driver_fare_df

                  0
type
Rural     55.486282
Suburban  39.502714
Urban     16.571468

In [162]:
#  6. Create a PyBer summary DataFrame. 

summary_city_df=pd.merge(ride_city_df, driver_city_df, on=["type"])
summary_city_df=pd.merge(summary_city_df, fare_city_df, on=["type"])
summary_city_df=pd.merge(summary_city_df, avg_ride_fare_df, on=["type"])
summary_city_df=pd.merge(summary_city_df, avg_driver_fare_df, on=["type"])
summary_city_df

          ride_id  driver_count      fare        0_x        0_y
type
Rural         125          78.0   4327.93  34.623440  55.486282
Suburban      625         490.0  19356.33  30.970128  39.502714
Urban        1625        2405.0  39854.38  24.525772  16.571468

In [163]:
#  7. Cleaning up the DataFrame. Delete the index name
summary_city_df.index.name = None
summary_city_df

          ride_id  driver_count      fare        0_x        0_y
Rural         125          78.0   4327.93  34.623440  55.486282
Suburban      625         490.0  19356.33  30.970128  39.502714
Urban        1625        2405.0  39854.38  24.525772  16.571468

In [164]:
#  8. Format the columns.


summary_city_df.dtypes

ride_id           int64
driver_count    float64
fare            float64
0_x             float64
0_y             float64
dtype: object

In [166]:

summary_city_df.rename(columns = {'ride_id' : 'Total Rides', 
                                  'driver_count' : 'Total Drivers', 
                                  'fare':'Total Fares', 
                                  '0_x':'Average Fare per Ride',
                                  '0_y':'Average Fare per Driver'}, inplace=True)

summary_city_df["Total Drivers"]=summary_city_df["Total Drivers"].map("{:,.0f}".format)
summary_city_df["Total Fares"] = summary_city_df["Total Fares"].map("${:,.2f}".format)
summary_city_df["Average Fare per Ride"] = summary_city_df["Average Fare per Ride"].map("${:,.2f}".format)
summary_city_df["Average Fare per Driver"] = summary_city_df["Average Fare per Driver"].map("${:,.2f}".format)

summary_city_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,1625,"2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [169]:
# 1. Read the merged DataFrame

city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [170]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
total_fare_per_date_df =pyber_data_df.groupby(["type", "date"]).sum()[["fare"]]
total_fare_per_date_df.head()

                            fare
type  date
Rural 2019-01-01 09:45:36  43.69
      2019-01-02 11:18:32  52.12
      2019-01-03 19:51:01  19.90
      2019-01-04 03:31:26  24.88
      2019-01-06 07:38:40  47.33

In [173]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()

total_fare_per_date_df=total_fare_per_date_df.reset_index()

total_fare_per_date_df.head()

    type                 date   fare
0  Rural  2019-01-01 09:45:36  43.69
1  Rural  2019-01-02 11:18:32  52.12
2  Rural  2019-01-03 19:51:01  19.90
3  Rural  2019-01-04 03:31:26  24.88
4  Rural  2019-01-06 07:38:40  47.33

In [ ]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date.

In [ ]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [ ]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [ ]:
# 7. Check that the datatype for the index is datetime using df.info()

In [ ]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')